_tests_/load/load-test.yml
config:
  # This is a test server run by team Artillery
  target: http://localhost:3000

  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

  plugins:
    ensure: {}
    apdex: {}
  ensure:
    p95: 200
  apdex:
    threshold: 100
    
scenarios:
  - flow:
    - loop:
      - post:
          url: "/realtors"
          json:
            name: "Jean"
            age: 50
            email: "jean@test.com"
            password: "jean123456"
            phoneNumber: 123456
            roleAdmin: false
      - get:
          url: "/biens"
      - get:
          url: "/keywords"
      - get:
          url: "/annonces"
    count: 100